# WallId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallFoundation..::..WallId Property
WallFoundation Class See Also
---
Returns the id of the host wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ElementId WallId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WallId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ WallId {
	ElementId^ get ();
}
```

# See Also
WallFoundation Class
Autodesk.Revit.DB Namespace